<?php
// +----------------------------------------------------------------------
// | SparkShop 坚持做优秀的商城系统
// +----------------------------------------------------------------------
// | Copyright (c) 2022~2099 http://sparkshop.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: NickBai  <1902822973@qq.com>
// +----------------------------------------------------------------------

return [

    // 支付状态
    'pay_status' => [
        1 => '待支付',
        2 => '已支付',
        3 => '已退款',
        4 => '部分退款',
        5 => '部分支付',
        6 => '支付异常'
    ],

    // 支付方式
    'pay_way' => [
        1 => '微信',
        2 => '支付宝',
        3 => '余额'
    ],

    // 订单状态
    'order_status' => [
        1 => '待确认',
        2 => '待支付',
        3 => '待发货',
        4 => '待收货',
        5 => '部分发货',
        6 => '交易完成',
        7 => '已取消',
        8 => '已关闭',
        9 => '库存不足'
    ],

    // 订单类型
    'order_type' => [
        1 => '普通订单',
        2 => '拼团订单',
        3 => '秒杀订单',
        4 => '砍价订单'
    ],

    // 退款订单状态
    'refund_status' => [
        1 => '退款申请中',
        2 => '退款审批中',
        3 => '已退款'
    ],

    // 售后订单状态
    'refund_order_status' => [
        1 => '待审批',
        2 => '已退款',
        3 => '已拒绝',
        4 => '取消'
    ],
];